previousPMs/PM3.2/WeatherRESTCA/src/jbiasa/WeatherRESTCA.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="WeatherRESTCA"
             xmlns:tns="WeatherRESTCA" xmlns:ns="http://j2ee.netbeans.org/wsdl/WeatherRESTfulBPEL/src/WeatherRequestor" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/WeatherRESTfulBPEL/src/WeatherRequestor" location="../jbiServiceUnits/WeatherRESTfulBPEL/WeatherRequestor.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:WeatherRequestorPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="WeatherRequestorOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="WeatherRESTCA"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="WeatherRESTCA"/>
            </output>
        </operation>
    </binding>
    <service name="WeatherRESTCAService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/WeatherRESTCAService1/casaPort1"/>
        </port>
    </service>
</definitions>
