previousPMs/PM3.2/WeatherRESTCA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:weat="WeatherRESTCA">
  <soapenv:Body>
    <weat:WeatherRequestorOperation>
      <cityID>1819729</cityID>
    </weat:WeatherRequestorOperation>
  </soapenv:Body>
</soapenv:Envelope>